Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: གོས་བརྟག་པ་དང་ནོར་བུ་བརྟག་པ་དང་རིན་པོ་ཆེ་བརྟག་པ་དང་། སྤོས་བརྟག་པ་དང་སྨན་བརྟག་པ་དང་། གླང་པོ་ཆེ་བརྟག་པ་དང་རྟ་བརྟག་པ་དང་གོ་མཚོན་བརྟག་པ་བསླབས་ཏེ།
en: and the examination of cloth, jewels, gems, incense, medicine, elephants, horses, and arms and armor.

source: ཡི་གེ་མཁས་པ་དང་ཀློག་མཁས་པ་དང་། མཛངས་པ་དང་བྱ་བ་ལ་གསལ་བ་དང་ཡིད་གཞུངས་པ་དང་བརྟག་པ་རྣམ་པ་བརྒྱད་ལ་བྱང་བར་གྱུར་ཏོ། །
en: He became skilled in writing, skilled at reading, learned, decisive, industrious, a master of the eight types of examination.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ཀྱང་མིག་ཆུང་རབ་ཏུ་དབྱུང་བའི་དུས་ལ་བབ་པར་མཐོང་ནས།
en: One day Venerable Śāriputra saw that the time had come for Little Eyes to go forth.

source: སྔ་དྲོ་ཤམ་ཐབས་དང་ཆོས་གོས་བགོས་ཏེ་ལྷུང་བཟེད་ཐོགས་ནས་མཉན་དུ་ཡོད་པར་བསོད་སྙོམས་ལ་སོང་སྟེ།
en: In the morning he donned his lower garment and Dharma robes, and, carrying his alms bowl, he went for alms in Śrāvastī.

source: དེ་མཐར་གྱིས་བསོད་སྙོམས་རྒྱུ་བ་ལས། ཁྱིམ་བདག་དེའི་ཁྱིམ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་སྟན་བཤམས་པ་ལ་འདུག་གོ། །
en: As he went for alms, he eventually came to the householder’s home, and there sat on the seat prepared for him.

source: འདུག་ནས་ཀྱང་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ཁྱིམ་བདག་དེ་ལ་སྨྲས་པ། ཁྱིམ་བདག་ཁྱེའུ་འདི་ནི་མ་བཙས་པའི་སྔ་རོལ་ནས་ཁྱོད་ཀྱིས་བདག་གི་གཡོག་ཏུ་བྱིན་ཏེ
en: After he had taken his seat, Venerable Śāriputra reminded the householder, “Householder, before this child was born you granted him to me as an attendant.

source: ཁོང་དགེ་བ་རྣམས་ནི་དམ་བཅས་པ་ལ་བརྟན་པ་ཡིན་ན།
en: The virtuous keep their promises, do they not?

source: དེ་ཁོ་ན་ལྟར་དམ་མ་བཅས་སམ།
en: Didn’t you yourself make such a promise?”

source: ཁྱིམ་བདག་གིས་སྨྲས་པ། འཕགས་པ་དེ་ཁོ་ན་ལྟར་དམ་བཅས་ལགས་སོ་ཞེས་བྱས་ནས།
en: “Yes, noble one, I did make just such a promise,” the householder replied,

source: ཁྱེའུ་དེ་ལག་པ་གཉིས་ཀྱིས་བཟུང་སྟེ། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་ཕུལ་ནས་སྨྲས་པ། བུ་ཁྱོད་མ་བཙས་པའི་སྔ་རོལ་ནས།
en: and he took the child by his two hands, offered him to Venerable Śāriputra, and told him,

source: འཕགས་པ་ལ་ངས་ཕུལ་གྱིས་སོང་ལ་འཕགས་པའི་ཞམ་རིང་གྱིས་ཤིག །
en: “Child, before you were born, I offered you to the noble one. Therefore go, and be an attendant of the noble one.”

source: ཁྱེའུས་སྨྲས་པ།
en: The child said,

source: དེ་ནི་བདག་ལ་ཕན་བཏགས་པ་ལགས་སོ་ཞེས་བྱས་ནས། ཁྱེའུ་དེ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུའི་ཕྱི་བཞིན་འབྲང་སྟེ།
en: “This will be of benefit to me,” and with those words he followed Venerable Śāriputra away.

source: ཁྱེའུ་དེ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས། གཙུག་ལག་ཁང་དུ་ཁྲིད་ནས་རབ་ཏུ་ཕྱུང་སྟེ། དེ་ལ་ལུང་ཡང་ཕོག་གོ། །
en: Venerable Śāriputra brought the child to the monastery, where he led him to go forth as a novice and instructed him.

source: དེས་ཀྱང་དགེ་ཚུལ་བ་བྱེད་བཞིན་དུ་བརྩོན་པ་དང་བསྒྲུབ་པ་དང་འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ཏེ།
en: Still in his novitiate, the child cast away all afflictive emotions through diligence, practice, and effort, and manifested arhatship.

source: དེ་དགྲ་བཅོམ་པ་ཁམས་གསུམ་པའི་འདོད་ཆགས་དང་བྲལ་བར་གྱུར་ནས།
en: As an arhat, free from the attachments of the three realms,

source: གསེར་དང་བོང་བར་མཉམ་པ། ནམ་མཁའ་དང་ལག་མཐིལ་དུ་འདྲ་བའི་སེམས་དང་ལྡན་པ།
en: his mind regarded gold no differently than filth, and the palms of his hands as like space itself.

source: ཙན་དན་སྦངས་པ་ལྟ་བུར་བསིལ་བར་གྱུར་པ།
en: He became cool like wet sandalwood.

source: རིག་པས་སྒོ་ངའི་སྦུབས་བཅོམ་པ།
en: His insight crushed ignorance like an eggshell.

source: རིག་པ་དང་མངོན་པར་ཤེས་པ་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་ཐོབ་པ།
en: He achieved the insights, superknowledges, and discriminations.

source: སྲེད་པའི་རྙེད་པ་དང་ཆགས་པ་དང་བཀུར་སྟི་ལ་རྒྱབ་ཀྱིས་
en: He had no regard for worldly profit, passion, or acclaim.

source: ཕྱོགས་པ་དང་དབང་པོ་དང་ཉེ་དབང་དང་བཅས་པའི་ལྷ་རྣམས་ཀྱིས་མཆོད་ཅིང་རྗེད་པ་དང་གུས་པར་སྨྲ་བའི་གནས་སུ་གྱུར་ཏོ། །
en: He became an object of offering, veneration, and respectful address by Indra, Upendra, and the other gods.

source: དེས་དགྲ་བཅོམ་པ་ཉིད་ཐོབ་ནས།
en: One time after he had attained arhatship,

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུའི་རྐང་པ་གཉིས་སྣུམ་གྱིས་སྐུད་པ་ན། དེས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུའི་རྐང་པའི་རྨའི་སྒྲོས་མཐོང་ངོ་། །མཐོང་ནས་དྲིས་པ།
en: he saw scars on Venerable Śāriputra’s feet as he was anointing them and asked,

source: མཁན་པོའི་རྨའི་སྒྲོས་འདི་སྔོན་ཅི་ལས་གྱུར་ལགས།
en: “Preceptor, how did you get these scars?”

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་སྨྲས་པ། བུ་རྨའི་སྒྲོས་འདི་སྔོན་ཅི་ལས་གྱུར་པ་སོམས་ཤིག །
en: “Child,” Venerable Śāriputra told him, “think on how I got these scars.”

source: དེ་ནས་དེས་བདག་ཉིད་ཀྱིས་སྔོན་ཁྱིར་གྱུར་པའི་ཚེ་ཟིན་པར་མཐོང་ནས་
en: “I see it was I who bit him in a previous life as a dog,” thought the novice.

source: དེས་བདག་གང་ནས་ཤི་འཕོས་ཏེ། ཁྱིར་སྐྱེས་པར་གྱུར་ཅེས་བསམས་ན།
en: “And I see the life from which I died, transmigrated, and took rebirth as a dog.”

source: དེས་ཁྱི་ལས་ཤི་འཕོས་ཏེ་ཁྱི་ཉིད་དུ་སྐྱེས་པར་མཐོང་ངོ་། །
en: He saw that he had died and taken rebirth as that dog,

source: དེ་བཞིན་དུ་དེས་ཚེ་རབས་ལྔ་བརྒྱའི་བར་དུ་བལྟས་ན་དེས་ཁྱི་ལས་ཤི་འཕོས་ཏེ། ཁྱི་འབའ་ཞིག་ཏུ་སྐྱེས་པར་མཐོང་ངོ་། །
en: and he also saw that for five hundred lifetimes he had died as a dog, transmigrated, and taken rebirth only as a dog.

source: དེས་ཡང་མ་འོངས་པའི་དུས་ལ་བསམས་ཏེ། གལ་ཏེ་བདག་ལ་མཁན་པོས་མ་དགོངས་སུ་ཟིན་ན།
en: He thought, “Had my preceptor not thought of me, where would I have taken rebirth in the future when I died there and transmigrated?”

source: བདག་དེ་ནས་ཤི་འཕོས་ན། གང་དུ་སྐྱེ་བར་འགྱུར་སྙམ་དུ་བསམས་ན་དེས་ཁྱི་དེ་ཉིད་དུ་དེའུ་སྐྱེས་པར་མཐོང་ངོ་། །
en: Reflecting in this way, he saw himself taking birth again as that very dog.

source: དེ་བཞིན་དུ་དེས་མ་འོངས་པའི་དུས་སུ་ཚེ་རབས་ལྔ་བརྒྱའི་བར་ཏུ་བལྟས་ན་དེས་ཁྱི་ལས་ཤི་འཕོས་ནས་ཁྱི་འབའ་ཞིག་ཏུ་དེའུ་སྐྱེས་པར་མཐོང་ནས།
en: In the same way he saw himself for five hundred future lives dying, transmigrating, and taking birth over and over only as a dog.

source: དེས་བསམས་པ་བདག་འདིས་ལོག་པར་ལྟུང་བ་ལས་རྣམ་པར་གྲོལ་བར་བྱས་ཏེ་
en: “It was he who saved me from falling so low!” he thought further.

source: གཡུང་དྲུང་གི་མཐར་ཐུག་པ་གྲུབ་པ་དང་བདེ་བ་མྱ་ངན་ལས་འདས་པ་ལ་བཞག་པས་མཁན་པོ་ནི་བདག་ལ་དཀའ་བ་བྱེད་བྱེད་པ་ཡིན་ནོ་སྙམ་ནས
en: “By establishing me in the unsurpassed, supreme welfare of nirvāṇa, my preceptor undertook a difficult task for me, over and over again.

source: བསྙེན་བཀུར་བྱ་བ་ལས་གུད་ན་མཁན་པོའི་དྲིན་བདག་གིས་བསབ་པའི་ཐབས་གཞན་ཅི་ཡོད་
en: What method is there to repay the kindness of one’s preceptor, other than service and respect?

source: དེ་བསྙེན་པར་རྫོགས་ནས་ནི་བདག་གིས་བསྙེན་བཀུར་རིམ་གྱིས་བྱར་མི་རུང་ན།
en: When I take full ordination I won’t be able to offer such service—

source: མ་ལ་བདག་ཇི་སྲིད་འཚོའི་བར་དུ་དགེ་ཚུལ་བར་འདུག་ལ་འདི་ལ་བསྙེན་བཀུར་བྱའོ་སྙམ་དུ་བསམས་ནས།
en: but oh! By remaining a novice for as long as I live I can continue to serve him respectfully.”

source: དེས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་སྨྲས་པ།
en: With this in mind, he said to Venerable Śāriputra,

source: མཁན་པོ་བདག་ཇི་སྲིད་འཚོའི་བར་དུ་མཁན་པོའི་བསྙེན་བཀུར་བ་བགྱིད་དོ། །
en: “Preceptor, for as long as I live I shall serve my preceptor with respect,”

source: བུ་ཁྱོད་ཇི་ལྟར་དགའ་བ་བཞིན་གྱིས་ཤིག །
en: and Śāriputra replied, “Do as you wish, my child.”

source: དེ་ནས་ཕྱིས་དེ་ལ་དགེ་སློང་རྣམས་ཀྱིས་སྨྲས་པ། མིག་ཆུང་ཁྱོད་ཅིའི་ཕྱིར་བསྙེན་པར་རྫོགས་པར་མི་བྱེད།
en: One day the monks asked him, “Little Eyes, why don’t you take full ordination?”

source: དེས་སྨྲས་པ། བདག་གིས་མཁན་པོའི་དྲིན་བསབ་དགོས་ཏེ།
en: “I must repay the kindness of my preceptor,” he told them.

source: བདག་ཇི་སྲིད་འཚོའི་བར་དུ་དགེ་ཚུལ་བར་འདུག་བཞིན་དུ་དེའི་བསྙེན་བཀུར་བྱེད་དོ། །
en: “By remaining a novice for as long as I live, I shall be able to serve him respectfully.”

source: དེ་དག་གིས་སྨྲས་པ། ཁྱོད་ལ་མཁན་པོས་ལྷག་པར་དྲིན་ཅི་ཞིག་བཏགས།
en: “What particular kindness did your preceptor do for you?” they asked.

source: དེ་ནས་དེས་དགེ་སློང་དེ་དག་ལ་གཏམ་དེ་རྒྱས་པར་བསྙད་ནས། དགེ་སློང་དེ་དག་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ།
en: He told the monks the story in detail, whereupon the monks inquired of the Blessed Buddha,

source: བཙུན་པ་མིག་ཆུང་གིས་ལས་ཅི་བགྱིས་ན། ལས་དེའི་རྣམ་པར་སྨིན་པས་ཁྱིར་སྐྱེས་ལ།
en: “Lord, what action did Little Eyes take that ripened into his birth as a dog,

source: གལ་ཏེ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་མ་བསམས་སུ་ལགས་ན། ཚེ་རབས་ལྔ་བརྒྱར་ཁྱི་འབའ་ཞིག་ཏུ་དེའུ་སྐྱེས་ལགས།
en: such that, if Venerable Śāriputra had not thought of him, he would have taken rebirth only as a dog for five hundred lifetimes,

source: ལས་ཅི་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་ཁྱི་ལས་ཤི་འཕོས་ཏེ། སླར་མིའི་ནང་དུ་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ནས།
en: and what action did he take that once he had died as a dog he transmigrated and took birth once again as a human into a family of great means, prosperity, and wealth?

source: འདིས་བཅོམ་ལྡན་འདས་མཉེས་པར་བགྱིས་ཏེ། མི་མཉེས་པར་མ་བགྱིས་ལ། བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བགྱིས་ལགས།
en: What action did he take that he pleased the Blessed One, did not displease him, went forth in the doctrine of the Blessed One, cast away all afflictive emotions, and manifested arhatship?

source: ལས་ཅི་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་མིག་ཆུང་ངུར་གྱུར་ལགས།
en: What action did he take that ripened into his having small eyes?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་མིག་ཆུང་འདི་ཉིད་ཀྱིས་སྔོན་ལས་བྱས་ཤིང་བསགས་ཏེ
en: “Monks,” explained the Blessed One, “Little Eyes committed and accumulated the actions himself at a previous time.

source: དགེ་སློང་དག་ལས་བྱས་ཤིང་བསགས་པ་རྣམས་ནི། ཕྱི་རོལ་གྱི་སའི་ཁམས་ལ་རྣམ་པར་སྨིན་པར་མི་འགྱུར།
en: Monks, the actions that he committed and accumulated did not ripen into the external element of earth.

source: ཆུའི་ཁམས་དང་མེའི་ཁམས་དང་རླུང་གི་ཁམས་ལ་རྣམ་པར་སྨིན་པར་མི་འགྱུར་ཏེ།
en: They did not ripen into the element of water, nor the element of fire, nor the element of wind.

source: ལས་དགེ་བ་དང་མི་དགེ་བ་བྱས་ཤིང་བསགས་པ་རྣམས་ནི་ཟིན་པའི་ཕུང་པོ་དང་ཁམས་དང་སྐྱེ་མཆེད་རྣམས་འབའ་ཞིག་ལ་རྣམ་པར་སྨིན་པར་འགྱུར་རོ། །
en: The actions he committed and accumulated, both virtuous and nonvirtuous, ripened into nothing but his own aggregates, sense bases, and constituent elements.

source: ལུས་ཅན་དག་གི་ལས་རྣམས་ནི། །བསྐལ་པ་བརྒྱར་ཡང་ཆུད་མི་ཟ། །ཚོགས་ཤིང་དུས་ལ་བབ་པ་ན། །འབྲས་བུ་ཉིད་དུ་སྨིན་པར་འགྱུར། །
en: “When the time arrives—even if A hundred eons pass— Fruit is born of every act That sentient beings amass.

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་བདེ་བར་གཤེགས་པ་འཇིག་རྟེན་མཁྱེན་པ་སྐྱེས་བུ་གདུལ་བྱའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ
en: the tathāgata, the arhat, the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Kāśyapa was in the world,

source: དེའི་ཚེ་གྲོང་ཁྱེར་བཱ་རཱ་ཎ་སཱི་ན་ཁྱིམ་བདག་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བ། ཡོངས་སུ་འཛིན་པ་ཡངས་ཤིང་རྒྱ་ཆེ་བ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་ལྡན་པ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་འགྲན་པ་ཞིག་གནས་ཏེ
en: there lived in the city of Vārāṇasī a certain householder, prosperous and wealthy, a person of vast and magnificent means, endowed with the wealth of Vaiśravaṇa—with wealth to rival Vaiśravaṇa’s.

source: ཕྱི་ཞིག་ན་དེའི་ཆུང་མ་ལ་བུ་ཆགས་ནས། དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་ཁྱེའུ་གཟུགས་བཟང་ཞིང་། བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙས་ནས།
en: “One day his wife conceived, and after nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful.

source: དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ། དེས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་དད་པ་རྙེད་ནས། ཕ་མ་ལ་གསོལ་ཏེ་རབ་ཏུ་བྱུང་ངོ་། །
en: When he grew up he found faith in the doctrine of the totally and completely awakened Buddha Kāśyapa, and after asking for his parents’ permission, went forth.

source: གོས་དང་ཟས་དང་མལ་ཆ་དང་སྟན་དང་ནད་གསོས་དང་སྨན་ཟོང་རྣམས་རྙེད་པར་གྱུར་ནས། དེས་བསམས་པ་མ་ལ་བདག་གིས་
en: Having acquired provisions of clothing, food, bedding, a seat, and medicines for the sick, he thought to himself, ‘How wonderful!

source: རྙེད་པ་དང་བཀུར་སྟིའི་སྒོ་ནས། རྙེད་པར་བྱ་བ་རྙེད་པ་གང་ཡིན་པ་དེས། བདག་གིས་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་རྣམས་ལ་ཕན་གདགས་པར་བྱ་གོར་མ་ཆག་སྙམ་དུ་བསམས་ནས། ཆོས་བཞིན་དུ་དགེ་འདུན་གྱི་ཞལ་ཏ་བྱས་ཏེ།
en: With all the profit and acclaim I’ve gained, I can see to the welfare of fellow practitioners of the holy life.’ And he served the twofold saṅgha in accordance with the Dharma.

source: དེ་ནས་ཕྱི་ཞིག་ན་དགེ་སློང་དགྲ་བཅོམ་པ་ཞིག་ལ་ཕྱི་དྲོའི་གུང་སྐྱེམས་ཀྱི་ཞལ་ཏ་བྱེད་པའི་རེས་བབ་ནས།
en: “One evening, one of his duties, that of serving the evening drink, fell instead to an arhat monk.

source: དེས་དགེ་འདུན་ལ་གུང་སྐྱེམས་བྲིམས་པའི་འོག་ཏུ་ལུས་ངལ་ཏེ་གནས་ཁང་དུ་སོང་ནས་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་
en: After distributing the evening drink to the saṅgha, the arhat was weary, so he went to his quarters, crossed his legs, and sat down.

source: འདུག་གོ་དེ་ནས་ཞལ་ཏ་བྱེད་པ་དེའི་སྦྱིན་བདག་རྣམས་ལ་གུང་སྐྱེམས་དགོས་པར་གྱུར་ནསདེས་དགེ་སློང་གཞན་དག་ལ་སྨྲས་པ།
en: “The evening drink still needed to be served to the benefactors, who began to ask the other monks,

source: དེང་གུང་སྐྱེམས་ཀྱི་ཞལ་ཏ་བྱེད་པའི་རེས་སུ་ལ་བབ།
en: ‘Whose turn is it today to serve the evening drink?’

source: དེ་དག་གིས་སྨྲས་པ། དགེ་སློང་ཆེ་གེ་མོ་ཞིག་ལ་བབ་བོ། །
en: “They replied that today it was the monk so-and-so’s turn.

source: དེ་ནས་ཞལ་ཏ་བྱེད་པ་དེ་ཁྲོས་ནས་མིག་བཙུམས་ཏེ་མིག་འདི་འདྲ་བ་དེ་ཡིན་པ་ལྟ་ཞེས་སྨྲས་སོ། །
en: The one who was normally appointed to serve them, seething, closed his eyes as if asleep and said, ‘It’s the one whose eyes are like this—I’ll find him!’

source: དེ་སྐད་སྨྲས་ནས། དགྲ་བཅོམ་པ་དེ་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་ནས་སྨྲས་པ།
en: “Having said this, he went to the arhat and said,

source: བཙུན་པ་བདག་ནི་ཁྱེད་ཀྱི་ཕྱིར་སྦྱིན་བདག་དང་སྦྱིན་པ་པོ་རྣམས་དགའ་བར་བྱས་ནས། ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱེད་ན་
en: ‘Lord, for your sake I’ve pleased all our benefactors and patrons, and respectfully served your every need.

source: ཁྱེད་ནི་བདག་གི་དད་པས་བྱིན་པ་ལ་ལོངས་སྤྱོད་ནས། ཁྱི་བཞིན་དུ་ཚང་དུ་ཞུགས་ནས་ཉལ་ཞིང་འདུག་གམ་ཞེས་བྱས་སོ། །
en: Now that you’ve enjoyed all I’ve given you in faith, do you come home to sit and sleep like a dog?’

source: དེ་ནས་དགྲ་བཅོམ་པ་དེས་བསམས་པ།
en: “Thereupon the arhat thought,

source: ཉོན་མོངས་པ་འདི་ནི་དམས་ཤིང་ཉམས་པར་གྱུར་ཏེ། འཁོར་བ་ན་འཁོར་ཞིང་སྡུག་བསྔལ་ཆེན་པོ་རྙེད་ན་མི་རུང་ངོ་
en: ‘It’s not right for this emotionally afflicted person, who has become so abased, to circle in saṃsāra and meet with great suffering.’

source: སྙམ་དུ་བསམས་ནས་འདིའི་ར་མདའ་བྱ་དགོས་སོ་
en: Reflecting in this way, he thought, ‘I have to help him.’

source: སྙམ་སྟེ། ཞལ་ཏ་བྱེད་པ་དེ་ལ་སྨྲས་པ།
en: “With this thought he said to the monk,

source: བཙུན་པ་ཁྱོད་ཀྱིས་ང་སུ་ཡིན་པ་
en: ‘Lord, do you know who I am?

source: དང་། ཁྱོད་བདག་སུ་ཡིན་པ་ཤེས་སམ།
en: And do you know who you yourself are?’ “

source: དེས་སྨྲས་པ། ངས་ཤེས་ཏེ། ཁྱོད་ཀྱང་རབ་ཏུ་བྱུང་བ་ཡིན་ལ་ང་ཡང་རབ་ཏུ་བྱུང་བ་ཡིན་ནོ། །
en: ‘I know that you have gone forth,’ he replied, ‘as have I.’

source: དགྲ་བཅོམ་པས་སྨྲས་པ། འུ་བུ་ཅག་གཉིས་རབ་ཏུ་བྱུང་བར་འདྲ་མོད་ཀྱི་ཁྱོད་ནི་
en: “ ‘Though we two are like brothers in having gone forth,’ the arhat said,

source: བཅིང་བ་ཐམས་ཅད་ཀྱིས་བཅིངས་པའི་སོ་སོའི་སྐྱེ་བོ་ཡིན་ལ། ང་ནི་བཅིང་བ་ཐམས་ཅད་ལས་ངེས་པར་གྲོལ་བའི་དགྲ་བཅོམ་པ་ཡིན་ན་
en: ‘you are an ordinary person, bound by every fetter, whereas I am an arhat, liberated from every fetter.

source: ཁྱོད་ཀྱིས་ཚིག་རྩུབ་པོ་སྨྲས་ཀྱིས་ཉེས་པ་ལ་ཉེས་སོ་ཞེས་བཤགས་པར་གྱིས་ཤིག །
en: You’ve spoken harshly to me. You must acknowledge your mistake.

source: དེ་སྐད་ཐོས་པའི་མོད་ལ་ཞལ་ཏ་བྱེད་པ་དེ་འགྱོད་པ་ཆེན་པོ་སྐྱེས་ཏེའགྱོད་པ་ཆེན་པོ་སྐྱེས་ནས།
en: “Hearing his words, the monk was flooded with great regret.

source: དགེ་སློང་དེའི་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ། བཟོད་པ་གསོལ་ནས་ལྷག་པར་ཡང་སངས་རྒྱས་དང་། ཆོས་དང་དགེ་འདུན་ལ་བསྙེན་བཀུར་བྱས་སོ། །
en: He bowed down at the monk’s feet, asked his forgiveness, and with renewed vigor offered his respectful service to the Buddha, Dharma, and Saṅgha.

source: དེས་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་དེ་ཆོས་བཞིན་དུ་དགེ་འདུན་གྱི་ཞལ་ཏ་བྱས་ནས།
en: All his life, he practiced pure conduct and served the saṅgha in accord with the Dharma.

source: འཆི་ཀར་སྨོན་ལམ་བཏབ་པ།
en: “At the time of his death, he prayed,

source: ཀྱེ་མ་བདག་གིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་
en: ‘Oh, but by the root of virtue of my having gone forth in the doctrine of the totally and completely awakened Buddha Kāśyapa,

source: ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་པ་དང་། ཆོས་བཞིན་དུ་ཞལ་ཏ་བྱས་པའི་དགེ་བའི་རྩ་བ་འདིས་ན་བདག་གང་དང་། གང་དུ་སྐྱེ་བ་དེ་དང་དེར་ཅི་ནས་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེ་བར་ཤོག་ཤིག །ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ལུང་བསྟན་པ་གང་ཡིན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་
en: my practice of pure conduct all my life, and the service I rendered in accord with the Dharma, wherever I am born, may it be into a family of great means, prosperity, and wealth!

source: བདག་གིས་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག །
en: May I please and not displease Uttara, the young brahmin prophesied by the totally and completely awakened Buddha Kāśyapa to be the next blessed buddha.

source: བདག་གིས་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་ལ་ཚིག་རྩུབ་པོ་སྨྲས་པའི་སྡིག་པའི་ལས་དེའི་འབྲས་བུ་བདག་གིས་རྙེད་པར་མ་གྱུར་ཅིག ། ཅེས་བྱས་སོ། །
en: May I not meet with the results of the wrongful act of speaking harshly to fellow practitioners of the holy life.’

source: དགེ་སློང་དག་ཇི་སྙམ་དུ་སེམས།
en: “O monks, what do you think?

source: དེའི་ཚེ་དེའི་དུས་ན་ཞལ་ཏ་བྱེད་པར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི། དགེ་ཚུལ་པ་མིག་ཆུང་འདི་ཉིད་ཡིན་ཏེ།
en: The one who was of service then is now the novice Little Eyes.

source: དེས་དེར་དགྲ་བཅོམ་པ་དེ་ལ་ཚིག་རྩུབ་པོ་སྨྲས་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས། ཚེ་རབས་ལྔ་བརྒྱར་ཁྱིར་སྐྱེས་ཏེ།
en: The act of speaking harshly to the arhat ripened such that for five hundred lifetimes he took rebirth as a dog,

source: གལ་ཏེ་དགེ་སློང་ཤཱ་རིའི་བུས་མ་བསམས་སུ་ཟིན་ན། ཕྱིན་ཅད་ཀྱང་ཚེ་རབས་ལྔ་བརྒྱའི་བར་དུ་ཁྱི་འབའ་ཞིག་ཏུ་དེའུ་སྐྱེས་སོ། །
en: and had the monk Śāriputra not thought of him, he would have taken rebirth only as a dog for five hundred more lifetimes.

source: ཁྲོས་ནས་དེས་དགྲ་བཅོམ་པ་དེ་ཉིད་ཀྱི་མིག་ལྟར་བཅོས་ཏེ། མིག་བཙུམས་ནས་མིག་འདི་འདྲ་བ་དེ་ཡིན་པ་ལྟ་ཞེས་སྨྲས་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ནི། ད་ལྟར་མིར་སྐྱེས་ན་ཡང་མིག་གཉིས་འདི་འདྲ་བར་གྱུར་ཏོ། །
en: “The act of becoming angry, closing his eyes in imitation of the arhat, and saying, ‘It’s the one whose eyes are like this—I’ll find him!’ ripened into his birth as a human being whose eyes were just like that.

source: དེས་དེར་སྨོན་ལམ་བཏབ་སྟེ། ཀྱེ་མ་དགེ་བའི་རྩ་བ་འདིས་ན་བདག་ཅི་ནས་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེ་བར་ཤོག་ཤིག །ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་
en: The act of praying at that time, ‘By this root of virtue, wherever I am born, may it be into a family of great means, prosperity, and wealth.

source: བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ལུང་བསྟན་པ་གང་ཡིན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་བདག་གིས་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག །
en: May I please and not displease Uttara, the young brahmin prophesied by the totally and completely awakened Buddha Kāśyapa to be the next blessed buddha.

source: དེ་ཁོ་ནའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་གྱུར་ཅིག་ཅེས་བྱས་པའི་ལས་
en: Going forth in his doctrine alone, may I cast away all afflictive emotions and manifest arhatship,’

source: དེའི་རྣམ་པར་སྨིན་པས་ནི། ད་ལྟར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ཏེ
en: ripened such that he was born into a family of great means, prosperity, and wealth.

source: འདིས་ང་མཉེས་པར་བྱས་ཏེ། མི་མཉེས་པར་མ་བྱས་ལ། ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ།།
en: that he has pleased me, not displeased me, go forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship.”

source: རྫོགས་བྱེད་ཅེས་བྱ་བ་ནི།
en: The Story of Pūraṇa

source: དེའི་ཚེ་མཉན་དུ་ཡོད་པ་ན་ཁྱིམ་བདག་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བ་ཡོངས་སུ་འཛིན་པ་ཡངས་ཤིང་རྒྱ་ཆེ་བ་རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་ལྡན་པ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་འགྲན་པ་ཞིག་གནས་པ་དེས།
en: When the Blessed One was in Śrāvastī, there lived a certain householder, prosperous and wealthy, a person of vast and magnificent means, endowed with the wealth of Vaiśravaṇa—with wealth to rival Vaiśravaṇa’s.

source: ཐབས་ཟླར་བབ་པ་ལས་ཆུང་མ་བླངས་ནས་དེ་དེ་དང་ལྷན་ཅིག་ཏུ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་དོ། །
en: When the time came for him to marry he took a wife, and they enjoyed themselves and coupled.

source: དེ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་ཀྱང་ཁྱིམ་བདག་དེ་ལ་བུ་མེད་
en: But even though they enjoyed themselves and coupled, they had no children.

source: དེ་བུ་འདོད་པའི་ཕྱིར་དེས་ལྷ་རྣམས་ལ་ཡང་གསོལ་བ་བཏབ་སྟེ།
en: They desired a son, so the householder supplicated the gods.

source: ལྷ་གུ་ལང་དང་ཆུ་ལྷ་དང་ཀུ་བེ་ར་དང་བརྒྱ་བྱིན་དང་ཚངས་པ་ལ་སོགས་པ་དང་ཀུན་དགའ་ར་བའི་ལྷ་དང་ནགས་ཚལ་གྱི་ལྷ་དང་། ལམ་གྱི་བཞི་མདོའི་ལྷ་དང་སུམ་མདོའི་ལྷ་དང་གཏོར་མ་ལེན་པའི་ལྷ་དང་ལྷན་ཅིག་སྐྱེས་པའི་ལྷ་དང་ཆོས་འཐུན་པ་པ་དང་རྟག་ཏུ་ཕྱི་བཞིན་འབྲང་བའི་ལྷ་རྣམས་ལ་ཡང་གསོལ་བ་འདེབས་ཏེ
en: He prayed to Paśupati, Varuṇa, Kubera, Śakra, Brahmā, and the rest, and to the deities of the pleasure groves, the forest deities, the deities of the crossroads, the deities of forks in the road, the deities who receive strewn oblations, the deities of his inherited tradition, and the deities who are in constant attendance of righteous persons.

source: འཇིག་རྟེན་ན་ཡང་གསོལ་བ་བཏབ་པའི་རྒྱུས་བུ་དང་བུ་མོ་སྐྱེ་བར་འགྱུར་རོ་ཞེས་གྲག་མོད་ཀྱི། དེ་ཡང་དེ་ལྟ་ནི་མ་ཡིན་ཏེ།
en: While it is often said that praying to deities can cause a boy or a girl to be born, this is not true.

source: གལ་ཏེ་གསོལ་བ་བཏབ་པའི་རྒྱུས་བུ་དང་བུ་མོ་སྐྱེ་བར་འགྱུར་དུ་ཟིན་ན། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་བཞིན་དུ་རེ་རེ་ལ་ཡང་བུ་སྟོང་སྟོང་ཡོད་པར་འགྱུར་བའི་རིགས་སོ། །
en: If children could be made just by praying, every family would have them a thousand times over, like a universal monarch.

source: ཡེ་ནི་གནས་གསུམ་ཚོགས་པ་ལས་བུ་དང་བུ་མོ་སྐྱེ་བར་འགྱུར་ཏེ། གསུམ་གང་ཞེ་ན།
en: In fact, there are three circumstances that allow for the birth of a child: a child is born when

source: ཕ་མ་གཉིས་འདོད་ཆགས་ལངས་ཏེ་ཕྲད་པ་དང་མ་དུས་ལ་བབ་ཅིང་ཟླ་མཚན་དང་ལྡན་པ་དང་དྲི་ཟ་འོངས་པ་སྟེ། དྲི་ཟའི་སེམས་ཀྱང་རྗེས་སུ་ཆགས་པ་དང་ལྡན་པའམ་ཁོང་ཁྲོ་བ་དང་ལྡན་པ་རྣམ་པ་གཉིས་ལས་གང་ཡང་རུང་བས་སྐྱེས་པའོ། །
en: (1) lust arises in the parents and they have intercourse, (2) the mother still has her menstrual cycle and is approached by a gandharva, and (3) the gandharva’s mind is either attached or angry.

source: དེ་ནས་དེ་ཡང་གསོལ་བ་འདེབས་པ་ལྷུར་བྱེད་ལ་སེམས་ཅན་ཆེན་པོ་ཆེ་བར་གྲགས་པ། སྲིད་པ་ཐ་མ་པ་བཙལ་བར་བྱ་བ་རྙེད་པ་ཐར་པའི་སྐལ་བ་ཅན་དུ་གྱུར་པ། ཚོགས་བསགས་པ་མྱ་ངན་ལས་འདས་པ་ལ་ནང་དུ་བལྟས་པ། འཁོར་བ་ལས་ཕྱི་རོལ་ཏུ་བལྟས་པ། སྲིད་པར་འགྲོ་བའི་སྐྱེ་གནས་རྣམས་མི་འདོད་པ། ལུས་ཀྱི་ཐ་མ་འཛིན་པ་ཞིག་ཀྱང་དེའི་ཆུང་མའི་མངལ་དུ་སྐྱེས་སོ། །
en: Still, the householder remained intent on his prayers, and a great being took birth in his wife’s womb who was well renowned and had gained his final birth, had the good fortune to soon be liberated due to gathering the accumulations, had his sights set on nirvāṇa and had turned away from saṃsāra, had no desire for the states of rebirth in cyclic existence, and who had now assumed his final body.

source: བུད་མེད་མཁས་པའི་རང་བཞིན་ཅན་ཁ་ཅིག་ལ་ནི་ཐུན་མོང་མ་ཡིན་པའི་ཆོས་ལྔ་ཡོད་དེ།
en: A woman wise in nature possesses five extraordinary abilities.

source: སྐྱེས་པ་ཆགས་པར་ཡང་ཤེས་ལ་མ་ཆགས་པར་ཡང་ཤེས་པ་དང་དུས་ཀྱང་ཤེས་ལ་ཟླ་མཚན་ཡང་ཤེས་པ་དང་བུ་ཆགས་པ་ཤེས་པ་དང་། གང་ལས་བུ་ཆགས་པ་ཤེས་པ་དང་། ཁྱེའུ་ཡང་ཤེས་ལ་བུ་མོ་ཡང་ཤེས་པ་སྟེ།
en: She knows (1) whether a man is attracted to her, (2) the time of her menstrual cycle, (3) that she has conceived, (4) from whom she has conceived, and (5) whether the child is a boy or a girl,

source: གལ་ཏེ་ཁྱེའུ་ཡིན་ན་ནི་ལྟོ་གཡས་ལོགས་སུ་རྟེན་ཅིང་གནས་སོ། །གལ་ཏེ་བུ་མོ་ཡིན་ན་ནི། ལྟོ་གཡོན་ལོགས་ན་རྟེན་ཅིང་གནས་སོ། །
en: for if it is a baby boy it will stay on the right side of the womb, and if it is a girl it will stay on the left side of the womb.
